# 1833. Maximum Ice Cream Bars - MEDIUM

In [ ]:
def maxIceCream(costs, coins):
    sortcost = sorted(costs)
    sumer = 0
    index = 0
    while coins >= 0:
        if index > len(costs)-1:
            return sumer
        elif sortcost[index] <= coins:
            coins = coins - sortcost[index]
            sumer += 1
        else:
            return sumer
        index += 1
    return sumer

# 2545. Sort the Students by Their Kth Score - MEDIUM

In [3]:
def sortTheStudents(score, k):
    dic = {}
    output = []
    for index, i in enumerate(score):
        dic[index] = i[k]
    dic = dict(sorted(dic.items(), key=lambda item:item[1], reverse=True))
    for index, (key, value) in enumerate(dic.items()):
        output.append(score[key])
    return output
sortTheStudents([[10,6,9,1],[7,5,11,2],[4,8,3,15]], 2)

[[7, 5, 11, 2], [10, 6, 9, 1], [4, 8, 3, 15]]

# 1637. Widest Vertical Area Between Two Points Containing No Points - MEDIUM

In [16]:
def maxWidthOfVerticalArea(points):
    slist = sorted([s[0] for s in points])
    maxelem = 0
    for i in range(len(slist)-2):
        maxelem = max(abs(slist[i+1] - slist[i]), maxelem)
    return maxelem

maxWidthOfVerticalArea([[8,7],[9,9],[7,4],[9,7]])

1

# 2707. Extra Characters in a String - MEDIUM

In [24]:
def canBeEqual(s1, s2):
    listofswap = []
    listofswap.append(s1[2]+s1[1]+s1[0]+s1[3])
    listofswap.append(s1[0]+s1[3]+s1[2]+s1[1])
    
    if s2[2]+s2[1]+s2[0]+s2[3] in listofswap:
        return True
    elif s2[0]+s2[3]+s2[2]+s2[1] in listofswap:
        return True
    return False
canBeEqual("abcd", "cdab")

True

# 53. Maximum Subarray - MEDIUM

In [ ]:
# Kandane algorithm

def maxSubArray(nums):
    b = nums[0]
    summer = 0
    for i in nums:
        summer += i
        b = max(b, summer)
        if summer < 0:
            summer = 0
    return b

# 152. Maximum Product Subarray - MEDIUM

In [53]:
def maxProduct(nums):
    negatives = False
    if max(nums) < 0:
        negatives = True
    maximum = nums[0]
    summer = 1
    for i in nums:
        print(summer)
        summer *= i
        maximum = max(maximum, summer)
        if i == 0:
            summer = 1
        if negatives and summer < 0:
            summer = 1
    return maximum

maxProduct([-2,3,-4])

1
-2
-6

24

# 228. Summary Ranges - EASY

In [65]:
def summaryRanges(nums):
    output = []
    current = ""
    for i in range(len(nums)-1):
        if nums[i] == (nums[i+1]-1) and current == "":
            current = str(nums[i])
        elif nums[i] != nums[i+1]-1 and current != "":
            output.append(current + "->"+str(nums[i]))
            current = ""
        elif nums[i] != nums[i+1]-1 and current == "":
            output.append(str(nums[i]))
        if i == len(nums)-2:
            if current == "":
                output.append(str(nums[i+1]))
            elif current != "" and nums[i] == (nums[i+1]-1):
                output.append(current + "->"+str(nums[i+1]))
    return output
        
summaryRanges([0,2,3,4,6,8,9])

['0', '2->4', '6', '8->9']

# 392. Is Subsequence - EASY

In [69]:
def isSubsequence(s, t):
    index2 = 0
    for i in t:
        if s[index2] == i:
            index2 += 1
        if index2 == len(s):
            return True
    return False

isSubsequence("ab", "baab")

True

# 1148. Article Views I - EASY

In [13]:
import pandas as pd

data = [[1, 3, 5, '2019-08-01'], [1, 3, 6, '2019-08-02'], [2, 7, 7, '2019-08-01'], [2, 7, 6, '2019-08-02'], [4, 7, 1, '2019-07-22'], [3, 4, 4, '2019-07-21'], [3, 4, 4, '2019-07-21']]
views = pd.DataFrame(data, columns=['article_id', 'author_id', 'viewer_id', 'view_date']).astype({'article_id':'Int64', 'author_id':'Int64', 'viewer_id':'Int64', 'view_date':'datetime64[ns]'})

def article_views(views: pd.DataFrame) -> pd.DataFrame:
    v = views[views["author_id"] == views["viewer_id"]]
    return pd.DataFrame(v["author_id"].drop_duplicates().sort_values().values, columns=["id"])


article_views(views)

   id
0   4
1   7

In [27]:
import pandas as pd

data = [['Afghanistan', 'Asia', 652230, 25500100, 20343000000], ['Albania', 'Europe', 28748, 2831741, 12960000000], ['Algeria', 'Africa', 2381741, 37100000, 188681000000], ['Andorra', 'Europe', 468, 78115, 3712000000], ['Angola', 'Africa', 1246700, 20609294, 100990000000]]
world = pd.DataFrame(data, columns=['name', 'continent', 'area', 'population', 'gdp']).astype({'name':'object', 'continent':'object', 'area':'Int64', 'population':'Int64', 'gdp':'Int64'})

def big_countries(world: pd.DataFrame) -> pd.DataFrame:
    world = world[world["population"] > 25000000]
    world2 = world[world["area"] > 3000000] 
    return pd.concat([world, world2], ignore_index=True).drop(columns=["gdp", "continent"])

big_countries(world)

          name     area  population
0  Afghanistan   652230    25500100
1      Algeria  2381741    37100000

# 1683. Invalid Tweets - EASY

In [37]:
import pandas as pd

data = [[1, 'Vote for Biden'], [2, 'Let us make America great again!']]
tweets = pd.DataFrame(data, columns=['tweet_id', 'content']).astype({'tweet_id':'Int64', 'content':'object'})

def invalid_tweets(tweets: pd.DataFrame) -> pd.DataFrame:
    return tweets[tweets["content"].str.len() > 15].drop(columns="content")

invalid_tweets(tweets)

   tweet_id
1         2

# 1667. Fix Names in a Table - EASY

In [55]:
import pandas as pd

data = [[1, 'aLice'], [2, 'bOB']]
users = pd.DataFrame(data, columns=['user_id', 'name']).astype({'user_id':'Int64', 'name':'object'})

def fix_names(users: pd.DataFrame) -> pd.DataFrame:
    users["name"] = users["name"].str.lower().str.capitalize()
    return users.sort_values(by="user_id")

fix_names(users)

   user_id   name
0        1  Alice
1        2    Bob

# 1527. Patients With a Condition - EASY

In [62]:
import pandas as pd

data = [[1, 'Daniel', 'YFEV COUGH'], [2, 'Alice', ''], [3, 'Bob', 'DIAB100 MYOP'], [4, 'George', 'ACNE DIAB100'], [5, 'Alain', 'DIAB201']]
patients = pd.DataFrame(data, columns=['patient_id', 'patient_name', 'conditions']).astype({'patient_id':'int64', 'patient_name':'object', 'conditions':'object'})

def find_patients(patients: pd.DataFrame) -> pd.DataFrame:
    patients = patients[patients["conditions"].str.contains(r"(?:^|\s)DIAB1")]
    return patients
find_patients(patients)

   patient_id patient_name    conditions
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100

# 1907. Count Salary Categories - MEDIUM

In [67]:
import pandas as pd

data = [[3, 108939], [2, 12747], [8, 87709], [6, 91796]]
accounts = pd.DataFrame(data, columns=['account_id', 'income']).astype({'account_id':'Int64', 'income':'Int64'})

def count_salary_categories(accounts: pd.DataFrame) -> pd.DataFrame:
    low = len(accounts[accounts["income"] < 20000])
    mid = len(accounts[accounts["income"].between(20000, 50000)])
    high = len(accounts[accounts["income"] > 50000])
    df = pd.DataFrame([["Low Salary", low],["Average Salary", mid], ["High Salary", high]], columns=["category", "accounts_count"])
    return df

count_salary_categories(accounts)

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3

# 1741. Find Total Time Spent by Each Employee - EASY

In [79]:
import pandas as pd

data = [['1', '2020-11-28', '4', '32'], ['1', '2020-11-28', '55', '200'], ['1', '2020-12-3', '1', '42'], ['2', '2020-11-28', '3', '33'], ['2', '2020-12-9', '47', '74']]
employees = pd.DataFrame(data, columns=['emp_id', 'event_day', 'in_time', 'out_time']).astype({'emp_id':'Int64', 'event_day':'datetime64[ns]', 'in_time':'Int64', 'out_time':'Int64'})

def total_time(employees: pd.DataFrame) -> pd.DataFrame:
    employees["total_time"] = employees["out_time"] - employees["in_time"]
    employees = employees.groupby(["event_day", "emp_id"]).sum()
    return employees.drop(columns=["in_time", "out_time"]).reset_index().rename(columns={"event_day":"day"})
total_time(employees)

         day  emp_id  total_time
0 2020-11-28       1         173
1 2020-11-28       2          30
2 2020-12-03       1          41
3 2020-12-09       2          27

# 596. Classes More Than 5 Students - EASY

In [91]:
import pandas as pd

data = [['A', 'Math'], ['B', 'English'], ['C', 'Math'], ['D', 'Biology'], ['E', 'Math'], ['F', 'Computer'], ['G', 'Math'], ['H', 'Math'], ['I', 'Math']]
courses = pd.DataFrame(data, columns=['student', 'class']).astype({'student':'object', 'class':'object'})

def find_classes(courses: pd.DataFrame) -> pd.DataFrame:
    courses = courses.groupby("class").count()
    courses = courses[courses["student"] >= 5].drop(columns="student").reset_index()
    return courses
find_classes(courses)

  class
0  Math

# 511. Game Play Analysis I - EASY

In [99]:
import pandas as pd

data = [[1, 2, '2016-03-01', 5], [1, 2, '2016-05-02', 6], [2, 3, '2017-06-25', 1], [3, 1, '2016-03-02', 0], [3, 4, '2018-07-03', 5]]
activity = pd.DataFrame(data, columns=['player_id', 'device_id', 'event_date', 'games_played']).astype({'player_id':'Int64', 'device_id':'Int64', 'event_date':'datetime64[ns]', 'games_played':'Int64'})

def game_analysis(activity: pd.DataFrame) -> pd.DataFrame:
    activity = activity.sort_values(by="event_date").drop_duplicates("player_id").sort_values(by="player_id")
    return activity.drop(columns=["device_id", "games_played"]).rename(columns={"event_date":"first_login"})
game_analysis(activity)

   player_id first_login
0          1  2016-03-01
2          2  2017-06-25
3          3  2016-03-02

# 586. Customer Placing the Largest Number of Orders - EASY

In [111]:
import pandas as pd

data = [[1, 1], [2, 2], [3, 3], [4, 3]]
orders = pd.DataFrame(data, columns=['order_number', 'customer_number']).astype({'order_number':'Int64', 'customer_number':'Int64'})

def largest_orders(orders: pd.DataFrame) -> pd.DataFrame:
    if orders.empty:
        return orders.drop(columns="order_number")
    orders = orders.groupby("customer_number").count().reset_index()
    return orders[orders["order_number"] == max(orders['order_number'])].drop(columns="order_number")
largest_orders(orders)

   customer_number
2                3

# 1484. Group Sold Products By The Date - EASY

In [121]:
import pandas as pd

data = [['2020-05-30', 'Headphone'], ['2020-06-01', 'Pencil'], ['2020-06-02', 'Mask'], ['2020-05-30', 'Basketball'], ['2020-06-01', 'Bible'], ['2020-06-02', 'Mask'], ['2020-05-30', 'T-Shirt']]
activities = pd.DataFrame(data, columns=['sell_date', 'product']).astype({'sell_date':'datetime64[ns]', 'product':'object'})

def categorize_products(activities: pd.DataFrame) -> pd.DataFrame:
    newactivities = activities.groupby("sell_date")["product"].apply(lambda x: ", ".join(sorted(x.drop_duplicates()))).reset_index()
    return activities
categorize_products(activities)

   sell_date     product
0 2020-05-30   Headphone
1 2020-06-01      Pencil
2 2020-06-02        Mask
3 2020-05-30  Basketball
4 2020-06-01       Bible
5 2020-06-02        Mask
6 2020-05-30     T-Shirt

# 1693. Daily Leads and Partners - EASY

In [9]:
import pandas as pd

data = [['2020-12-8', 'toyota', 0, 1], ['2020-12-8', 'toyota', 1, 0], ['2020-12-8', 'toyota', 1, 2], ['2020-12-7', 'toyota', 0, 2], ['2020-12-7', 'toyota', 0, 1], ['2020-12-8', 'honda', 1, 2], ['2020-12-8', 'honda', 2, 1], ['2020-12-7', 'honda', 0, 1], ['2020-12-7', 'honda', 1, 2], ['2020-12-7', 'honda', 2, 1]]
daily_sales = pd.DataFrame(data, columns=['date_id', 'make_name', 'lead_id', 'partner_id']).astype({'date_id':'datetime64[ns]', 'make_name':'object', 'lead_id':'Int64', 'partner_id':'Int64'})

def daily_leads_and_partners(daily_sales: pd.DataFrame) -> pd.DataFrame:
    daily_sales = daily_sales.groupby(["date_id", "make_name"]).nunique().reset_index()
    return daily_sales.rename(columns={"lead_id":"unique_leads", "partner_id":"unique_partners"})
daily_leads_and_partners(daily_sales)

     date_id make_name  unique_leads  unique_partners
0 2020-12-07     honda             3                2
1 2020-12-07    toyota             1                2
2 2020-12-08     honda             2                2
3 2020-12-08    toyota             2                3

# 1050. Actors and Directors Who Cooperated At Least Three Times - EASY

In [17]:
import pandas as pd

data = [[1, 1, 0], [1, 1, 1], [1, 1, 2], [1, 2, 3], [1, 2, 4], [2, 1, 5], [2, 1, 6]]
actor_director = pd.DataFrame(data, columns=['actor_id', 'director_id', 'timestamp']).astype({'actor_id':'int64', 'director_id':'int64', 'timestamp':'int64'})

def actors_and_directors(actor_director: pd.DataFrame) -> pd.DataFrame:
    actor_director = actor_director.groupby(["actor_id", "director_id"]).count().reset_index()
    actor_director = actor_director[actor_director["timestamp"] >= 3]
    return actor_director.drop(columns="timestamp")
actors_and_directors(actor_director)

   actor_id  director_id
0         1            1

# 1378. Replace Employee ID With The Unique Identifier - EASY

In [28]:
import pandas as pd

data = [[1, 'Alice'], [7, 'Bob'], [11, 'Meir'], [90, 'Winston'], [3, 'Jonathan']]
employees = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'int64', 'name':'object'})
data = [[3, 1], [11, 2], [90, 3]]
employee_uni = pd.DataFrame(data, columns=['id', 'unique_id']).astype({'id':'int64', 'unique_id':'int64'})

def replace_employee_id(employees: pd.DataFrame, employee_uni: pd.DataFrame) -> pd.DataFrame:
    employees = employees.join(employee_uni.set_index("id"), on="id", how="left", rsuffix="_uni")
    employees = employees.fillna("null").drop(columns="id")
    temp = employees.copy()
    employees["unique_id"] = temp["name"]
    employees["name"] = temp["unique_id"]
    return employees.rename(columns={"name":"unique_id", "unique_id":"name"})
replace_employee_id(employees, employee_uni)

  unique_id      name
0      null     Alice
1      null       Bob
2       2.0      Meir
3       3.0   Winston
4       1.0  Jonathan

# 1280. Students and Examinations - EASY

In [45]:
import pandas as pd

data = [[1, 'Alice'], [2, 'Bob'], [13, 'John'], [6, 'Alex']]
students = pd.DataFrame(data, columns=['student_id', 'student_name']).astype({'student_id':'Int64', 'student_name':'object'})
data = [['Math'], ['Physics'], ['Programming']]
subjects = pd.DataFrame(data, columns=['subject_name']).astype({'subject_name':'object'})
data = [[1, 'Math'], [1, 'Physics'], [1, 'Programming'], [2, 'Programming'], [1, 'Physics'], [1, 'Math'], [13, 'Math'], [13, 'Programming'], [13, 'Physics'], [2, 'Math'], [1, 'Math']]
examinations = pd.DataFrame(data, columns=['student_id', 'subject_name']).astype({'student_id':'Int64', 'subject_name':'object'})

def students_and_examinations(students: pd.DataFrame, subjects: pd.DataFrame, examinations: pd.DataFrame) -> pd.DataFrame:
    result = students.join(examinations.set_index("student_id"), on="student_id", how="left", rsuffix="examinations")
    return result
students_and_examinations(students, subjects, examinations)

   student_id student_name subject_name
0           1        Alice         Math
0           1        Alice      Physics
0           1        Alice  Programming
0           1        Alice      Physics
0           1        Alice         Math
0           1        Alice         Math
1           2          Bob  Programming
1           2          Bob         Math
2          13         John         Math
2          13         John  Programming
2          13         John      Physics
3           6         Alex          NaN